# Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
AB = 179
BC = 971
AC = ((AB ** 2 + BC ** 2) ** 0.5)
print(AC)